package etc;

public class study {
    /*
       - 다향성 3가지 대 전제
       1. 부모타입의 변수는 자식객체 주소값을 담을 수 있다.
       2. 자식타입의 변수는 부모 객체 주소값을 담을 수 있다.
       3. 타입을 알고 메소드를 (형변환해서) 호출할수 있다.

        -  " Child child = new Child();" 에서 Child child는
       Child 객체 주소값도 받을수 있고 자식 주소값도 받을 수 있다.

       - override
       부모 클래스 메소드를 들고와서 내용만 고친후 다시 사용한다고 해서
       재정의라고 함!

       - abstract
       1. 추상메소드
       (상 메소드를 단 하나라도 가지고 있다면 클래스는 추상 클래스가 되어야 한다.)
       2. 추상클래스는 객체화가 되지 않게 만든다(객체가 없더라도)
       ^ 그이유는 부모역할만 하기 위해서


     */
}